In [39]:
import pandas as pd
from collections import defaultdict

In [40]:
pwd

'/Users/ioanwilliams/notebooks/Recommendation Systems/ml-latest-small'

In [41]:
ratings = pd.read_csv(r"ratings.csv")
ratings.drop('timestamp',axis=1,inplace=True)
print(ratings.dtypes)
ratings.head()

userId       int64
movieId      int64
rating     float64
dtype: object

   userId  movieId  rating
0       1       31     2.5
1       1     1029     3.0
2       1     1061     3.0
3       1     1129     2.0
4       1     1172     4.0

In [42]:
movies = pd.read_csv(r"movies.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [43]:
ratings.userId.max()
my_ratings = pd.read_csv(r"../movielens-ratings.csv")
my_ratings.drop(['title','average_rating','imdb_id','tmdb_id'],axis=1,inplace=True)
my_ratings['userId'] = ratings.userId.max() + 1
my_ratings.rename(columns={'movie_id': 'movieId'}, inplace=True)
my_ratings.shape
new_ratings = pd.merge(my_ratings, movies, how='inner', on=['movieId'])
new_ratings.drop(['title','genres'],axis=1,inplace=True)
new_ratings.head()

   movieId  rating  userId
0        1     3.0     672
1        2     2.5     672
2        6     4.0     672
3       10     4.0     672
4       11     2.0     672

In [44]:
#union my ratings and official ratings
all_ratings = pd.concat([ratings,new_ratings], sort = False)
all_ratings.tail()

     userId  movieId  rating
728     672   148626     4.0
729     672   150548     3.0
730     672   152091     1.0
731     672   159093     3.0
732     672   160438     3.0

In [45]:
all_ratings.count()

userId     100737
movieId    100737
rating     100737
dtype: int64

In [46]:
all_ratings.to_csv("all_ratings.csv")